miro-kostadinov/tmos/tmos/hardware/stm32/stm32f1/rcc_f1.h
/*
 * rcc_f1.h
 *
 *  Created on: Oct 25, 2012
 *      Author: miro
 */

#ifndef RCC_F1_H_
#define RCC_F1_H_

#include <mcu_inc.h>
#include <tmos_types.h>

/*******************************************************************************
 *  Reset and Clock Control registers
 ******************************************************************************/
typedef struct
{
  __IO uint32_t RCC_CR;				//!< (rcc Offset: 0x00) Clock control register
  __IO uint32_t RCC_CFGR;			//!< (rcc offset: 0x04) Clock configuration register
  __IO uint32_t RCC_CIR;			//!< (rcc Offset: 0x08) Clock interrupt register
  __IO uint32_t RCC_APB2RSTR;		//!< (rcc Offset: 0x0C) APB2 peripheral reset register
  __IO uint32_t RCC_APB1RSTR;		//!< (rcc Offset: 0x10) APB1 peripheral reset register
  __IO uint32_t RCC_AHBENR;			//!< (rcc Offset: 0x14) AHB Peripheral Clock enable register
  __IO uint32_t RCC_APB2ENR;		//!< (rcc Offset: 0x18) APB2 peripheral clock enable register
  __IO uint32_t RCC_APB1ENR;		//!< (rcc Offset: 0x1C) APB1 peripheral clock enable register
  __IO uint32_t RCC_BDCR;			//!< (rcc Offset: 0x20) Backup domain control register
  __IO uint32_t RCC_CSR;			//!< (rcc Offset: 0x24) Control/status register

#ifdef STM32F10X_CL
  __IO uint32_t RCC_AHBRSTR;		//!< (rcc Offset: 0x28) AHB peripheral clock reset register
  __IO uint32_t RCC_CFGR2;			//!< (rcc Offset: 0x2C) Clock configuration register2
#endif /* STM32F10X_CL */

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
  uint32_t 		RESERVED0;			//!< (rcc Offset: 0x28) reserved
  __IO uint32_t RCC_CFGR2;			//!< (rcc Offset: 0x2C) Clock configuration register2
#endif /* STM32F10X_LD_VL || STM32F10X_MD_VL || STM32F10X_HD_VL */
} RCC_TypeDef;

/*******************************************************************************
 * @defgroup RCC_regs_define
 * @{
 ******************************************************************************/

/** @defgroup RCC_CR:	 	(rcc Offset: 0x00) Clock control register		  */
#define RCC_CR_HSION        		0x00000001 //!< Internal High Speed clock enable
#define RCC_CR_HSIRDY           	0x00000002 //!< Internal High Speed clock ready flag
#define RCC_CR_HSITRIM          	0x000000F8 //!< Internal High Speed clock trimming
#define RCC_CR_HSICAL           	0x0000FF00 //!< Internal High Speed clock Calibration
#define RCC_CR_HSEON            	0x00010000 //!< External High Speed clock enable
#define RCC_CR_HSERDY           	0x00020000 //!< External High Speed clock ready flag
#define RCC_CR_HSEBYP           	0x00040000 //!< External High Speed clock Bypass
#define RCC_CR_CSSON            	0x00080000 //!< Clock Security System enable
#define RCC_CR_PLLON            	0x01000000 //!< PLL enable
#define RCC_CR_PLLRDY           	0x02000000 //!< PLL clock ready flag
#ifdef STM32F10X_CL
 #define RCC_CR_PLL2ON          	0x04000000 //!< PLL2 enable
 #define RCC_CR_PLL2RDY         	0x08000000 //!< PLL2 clock ready flag
 #define RCC_CR_PLL3ON          	0x10000000 //!< PLL3 enable
 #define RCC_CR_PLL3RDY         	0x20000000 //!< PLL3 clock ready flag
#endif /* STM32F10X_CL */
/** @} */

/** @defgroup RCC_CFGR:		(rcc offset: 0x04) Clock configuration register   */
/*!< SW configuration */
#define RCC_CFGR_SW    				0x00000003 //!< SW[1:0] bits (System clock Switch)
#define RCC_CFGR_SW_HSI       		0x00000000 //!< HSI selected as system clock
#define RCC_CFGR_SW_HSE         	0x00000001 //!< HSE selected as system clock
#define RCC_CFGR_SW_PLL         	0x00000002 //!< PLL selected as system clock

/*!< SWS configuration */
#define RCC_CFGR_SWS            	0x0000000C //!< SWS[1:0] bits (System Clock Switch Status)
#define RCC_CFGR_SWS_HSI        	0x00000000 //!< HSI oscillator used as system clock
#define RCC_CFGR_SWS_HSE        	0x00000004 //!< HSE oscillator used as system clock
#define RCC_CFGR_SWS_PLL        	0x00000008 //!< PLL used as system clock

/*!< HPRE configuration */
#define RCC_CFGR_HPRE           	0x000000F0 //!< HPRE[3:0] bits (AHB prescaler)
#define RCC_CFGR_HPRE_DIV1      	0x00000000 //!< SYSCLK not divided
#define RCC_CFGR_HPRE_DIV2      	0x00000080 //!< SYSCLK divided by 2
#define RCC_CFGR_HPRE_DIV4      	0x00000090 //!< SYSCLK divided by 4
#define RCC_CFGR_HPRE_DIV8      	0x000000A0 //!< SYSCLK divided by 8
#define RCC_CFGR_HPRE_DIV16     	0x000000B0 //!< SYSCLK divided by 16
#define RCC_CFGR_HPRE_DIV64     	0x000000C0 //!< SYSCLK divided by 64
#define RCC_CFGR_HPRE_DIV128    	0x000000D0 //!< SYSCLK divided by 128
#define RCC_CFGR_HPRE_DIV256    	0x000000E0 //!< SYSCLK divided by 256
#define RCC_CFGR_HPRE_DIV512    	0x000000F0 //!< SYSCLK divided by 512
#define RCC_CFGR_HPRE_Get(x)        (((x)>>4)&0xF)   //!< HPRE[3:0] get

/*!< PPRE1 configuration */
#define RCC_CFGR_PPRE1          	0x00000700 //!< PRE1[2:0] bits (APB1 prescaler)
#define RCC_CFGR_PPRE1_DIV1     	0x00000000 //!< HCLK not divided
#define RCC_CFGR_PPRE1_DIV2     	0x00000400 //!< HCLK divided by 2
#define RCC_CFGR_PPRE1_DIV4     	0x00000500 //!< HCLK divided by 4
#define RCC_CFGR_PPRE1_DIV8     	0x00000600 //!< HCLK divided by 8
#define RCC_CFGR_PPRE1_DIV16    	0x00000700 //!< HCLK divided by 16
#define RCC_CFGR_PPRE1_Get(x)    	(((x)>>8)& 7)   //!< PRE1[2:0] get

/*!< PPRE2 configuration */
#define RCC_CFGR_PPRE2          	0x00003800 //!< PRE2[2:0] bits (APB2 prescaler)
#define RCC_CFGR_PPRE2_DIV1     	0x00000000 //!< HCLK not divided
#define RCC_CFGR_PPRE2_DIV2     	0x00002000 //!< HCLK divided by 2
#define RCC_CFGR_PPRE2_DIV4     	0x00002800 //!< HCLK divided by 4
#define RCC_CFGR_PPRE2_DIV8     	0x00003000 //!< HCLK divided by 8
#define RCC_CFGR_PPRE2_DIV16    	0x00003800 //!< HCLK divided by 16
#define RCC_CFGR_PPRE2_Get(x)    	(((x)>>11)& 7)   //!< PRE2[2:0] get

/*!< ADCPPRE configuration */
#define RCC_CFGR_ADCPRE         	0x0000C000 //!< ADCPRE[1:0] bits (ADC prescaler)
#define RCC_CFGR_ADCPRE_DIV2    	0x00000000 //!< PCLK2 divided by 2
#define RCC_CFGR_ADCPRE_DIV4    	0x00004000 //!< PCLK2 divided by 4
#define RCC_CFGR_ADCPRE_DIV6    	0x00008000 //!< PCLK2 divided by 6
#define RCC_CFGR_ADCPRE_DIV8    	0x0000C000 //!< PCLK2 divided by 8
#define RCC_CFGR_ADCPRE_Get(x)    	(((x)>>14)& 3)   //!< ADCPRE[1:0] get

#define RCC_CFGR_PLLSRC         	0x00010000 //!< PLL entry clock source

#define RCC_CFGR_PLLXTPRE       	0x00020000 //!< HSE divider for PLL entry

