miro-kostadinov/tmos/tmos/hardware/stm32/stm32f1/rcc_f1.h
/*!< PLLMUL configuration */
#define RCC_CFGR_PLLMULL        	0x003C0000 //!< PLLMUL[3:0] bits (PLL multiplication factor)
#define RCC_CFGR_PLLMULL_Get(x)		(((x)>>18) &0xF)
#define RCC_CFGR_PLLMULL_Set(x)		(((x) &0xF)<<18)

#ifdef STM32F10X_CL
 #define RCC_CFGR_PLLSRC_HSI_Div2   0x00000000 //!< HSI clock divided by 2 selected as PLL entry clock source
 #define RCC_CFGR_PLLSRC_PREDIV1    0x00010000 //!< PREDIV1 clock selected as PLL entry clock source

 #define RCC_CFGR_PLLXTPRE_PREDIV1      0x00000000 //!< PREDIV1 clock not divided for PLL entry
 #define RCC_CFGR_PLLXTPRE_PREDIV1_Div2 0x00020000 //!< PREDIV1 clock divided by 2 for PLL entry

 #define RCC_CFGR_PLLMULL4      	0x00080000 //!< PLL input clock * 4
 #define RCC_CFGR_PLLMULL5      	0x000C0000 //!< PLL input clock * 5
 #define RCC_CFGR_PLLMULL6      	0x00100000 //!< PLL input clock * 6
 #define RCC_CFGR_PLLMULL7      	0x00140000 //!< PLL input clock * 7
 #define RCC_CFGR_PLLMULL8      	0x00180000 //!< PLL input clock * 8
 #define RCC_CFGR_PLLMULL9      	0x001C0000 //!< PLL input clock * 9
 #define RCC_CFGR_PLLMULL6_5    	0x00340000 //!< PLL input clock * 6.5

 #define RCC_CFGR_OTGFSPRE      	0x00400000 //!< USB OTG FS prescaler

/*!< MCO configuration */
 #define RCC_CFGR_MCO               0x0F000000 //!< MCO[3:0] bits (Microcontroller Clock Output)
 #define RCC_CFGR_MCO_NOCLOCK       0x00000000 //!< No clock
 #define RCC_CFGR_MCO_SYSCLK        0x04000000 //!< System clock selected as MCO source
 #define RCC_CFGR_MCO_HSI           0x05000000 //!< HSI clock selected as MCO source
 #define RCC_CFGR_MCO_HSE           0x06000000 //!< HSE clock selected as MCO source
 #define RCC_CFGR_MCO_PLLCLK_Div2   0x07000000 //!< PLL clock divided by 2 selected as MCO source
 #define RCC_CFGR_MCO_PLL2CLK       0x08000000 //!< PLL2 clock selected as MCO source
 #define RCC_CFGR_MCO_PLL3CLK_Div2  0x09000000 //!< PLL3 clock divided by 2 selected as MCO source
 #define RCC_CFGR_MCO_Ext_HSE       0x0A000000 //!< XT1 external 3-25 MHz oscillator clock selected as MCO source
 #define RCC_CFGR_MCO_PLL3CLK       0x0B000000 //!< PLL3 clock selected as MCO source
#elif defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
 #define RCC_CFGR_PLLSRC_HSI_Div2   0x00000000 //!< HSI clock divided by 2 selected as PLL entry clock source
 #define RCC_CFGR_PLLSRC_PREDIV1    0x00010000 //!< PREDIV1 clock selected as PLL entry clock source

 #define RCC_CFGR_PLLXTPRE_PREDIV1       0x00000000 //!< PREDIV1 clock not divided for PLL entry
 #define RCC_CFGR_PLLXTPRE_PREDIV1_Div2  0x00020000 //!< PREDIV1 clock divided by 2 for PLL entry

 #define RCC_CFGR_PLLMULL2      	0x00000000 //!< PLL input clock*2
 #define RCC_CFGR_PLLMULL3      	0x00040000 //!< PLL input clock*3
 #define RCC_CFGR_PLLMULL4      	0x00080000 //!< PLL input clock*4
 #define RCC_CFGR_PLLMULL5      	0x000C0000 //!< PLL input clock*5
 #define RCC_CFGR_PLLMULL6      	0x00100000 //!< PLL input clock*6
 #define RCC_CFGR_PLLMULL7      	0x00140000 //!< PLL input clock*7
 #define RCC_CFGR_PLLMULL8      	0x00180000 //!< PLL input clock*8
 #define RCC_CFGR_PLLMULL9      	0x001C0000 //!< PLL input clock*9
 #define RCC_CFGR_PLLMULL10     	0x00200000 //!< PLL input clock10
 #define RCC_CFGR_PLLMULL11     	0x00240000 //!< PLL input clock*11
 #define RCC_CFGR_PLLMULL12     	0x00280000 //!< PLL input clock*12
 #define RCC_CFGR_PLLMULL13     	0x002C0000 //!< PLL input clock*13
 #define RCC_CFGR_PLLMULL14     	0x00300000 //!< PLL input clock*14
 #define RCC_CFGR_PLLMULL15     	0x00340000 //!< PLL input clock*15
 #define RCC_CFGR_PLLMULL16     	0x00380000 //!< PLL input clock*16

/*!< MCO configuration */
 #define RCC_CFGR_MCO               0x07000000 //!< MCO[2:0] bits (Microcontroller Clock Output)
 #define RCC_CFGR_MCO_NOCLOCK       0x00000000 //!< No clock
 #define RCC_CFGR_MCO_SYSCLK        0x04000000 //!< System clock selected as MCO source
 #define RCC_CFGR_MCO_HSI           0x05000000 //!< HSI clock selected as MCO source
 #define RCC_CFGR_MCO_HSE           0x06000000 //!< HSE clock selected as MCO source
 #define RCC_CFGR_MCO_PLL           0x07000000 //!< PLL clock divided by 2 selected as MCO source
#else
 #define RCC_CFGR_PLLSRC_HSI_Div2   0x00000000 //!< HSI clock divided by 2 selected as PLL entry clock source
 #define RCC_CFGR_PLLSRC_HSE        0x00010000 //!< HSE clock selected as PLL entry clock source

 #define RCC_CFGR_PLLXTPRE_HSE      0x00000000 //!< HSE clock not divided for PLL entry
 #define RCC_CFGR_PLLXTPRE_HSE_Div2 0x00020000 //!< HSE clock divided by 2 for PLL entry

 #define RCC_CFGR_PLLMULL2          0x00000000 //!< PLL input clock*2
 #define RCC_CFGR_PLLMULL3          0x00040000 //!< PLL input clock*3
 #define RCC_CFGR_PLLMULL4          0x00080000 //!< PLL input clock*4
 #define RCC_CFGR_PLLMULL5          0x000C0000 //!< PLL input clock*5
 #define RCC_CFGR_PLLMULL6          0x00100000 //!< PLL input clock*6
 #define RCC_CFGR_PLLMULL7          0x00140000 //!< PLL input clock*7
 #define RCC_CFGR_PLLMULL8          0x00180000 //!< PLL input clock*8
 #define RCC_CFGR_PLLMULL9          0x001C0000 //!< PLL input clock*9
 #define RCC_CFGR_PLLMULL10         0x00200000 //!< PLL input clock10
 #define RCC_CFGR_PLLMULL11         0x00240000 //!< PLL input clock*11
 #define RCC_CFGR_PLLMULL12         0x00280000 //!< PLL input clock*12
 #define RCC_CFGR_PLLMULL13         0x002C0000 //!< PLL input clock*13
 #define RCC_CFGR_PLLMULL14         0x00300000 //!< PLL input clock*14
 #define RCC_CFGR_PLLMULL15         0x00340000 //!< PLL input clock*15
 #define RCC_CFGR_PLLMULL16         0x00380000 //!< PLL input clock*16
 #define RCC_CFGR_USBPRE            0x00400000 //!< USB Device prescaler

/*!< MCO configuration */
 #define RCC_CFGR_MCO               0x07000000 //!< MCO[2:0] bits (Microcontroller Clock Output)
 #define RCC_CFGR_MCO_NOCLOCK       0x00000000 //!< No clock
 #define RCC_CFGR_MCO_SYSCLK        0x04000000 //!< System clock selected as MCO source
 #define RCC_CFGR_MCO_HSI           0x05000000 //!< HSI clock selected as MCO source
 #define RCC_CFGR_MCO_HSE           0x06000000 //!< HSE clock selected as MCO source
 #define RCC_CFGR_MCO_PLL           0x07000000 //!< PLL clock divided by 2 selected as MCO source
#endif /* STM32F10X_CL */

/** @} */

/** @defgroup RCC_CIR:		(rcc Offset: 0x08) Clock interrupt register		  */
#define RCC_CIR_LSIRDYF             0x00000001 //!< LSI Ready Interrupt flag
#define RCC_CIR_LSERDYF             0x00000002 //!< LSE Ready Interrupt flag
#define RCC_CIR_HSIRDYF             0x00000004 //!< HSI Ready Interrupt flag
#define RCC_CIR_HSERDYF             0x00000008 //!< HSE Ready Interrupt flag
#define RCC_CIR_PLLRDYF             0x00000010 //!< PLL Ready Interrupt flag
#define RCC_CIR_CSSF                0x00000080 //!< Clock Security System Interrupt flag
#define RCC_CIR_LSIRDYIE            0x00000100 //!< LSI Ready Interrupt Enable
#define RCC_CIR_LSERDYIE            0x00000200 //!< LSE Ready Interrupt Enable
#define RCC_CIR_HSIRDYIE            0x00000400 //!< HSI Ready Interrupt Enable
#define RCC_CIR_HSERDYIE            0x00000800 //!< HSE Ready Interrupt Enable
#define RCC_CIR_PLLRDYIE            0x00001000 //!< PLL Ready Interrupt Enable
#define RCC_CIR_LSIRDYC             0x00010000 //!< LSI Ready Interrupt Clear
#define RCC_CIR_LSERDYC             0x00020000 //!< LSE Ready Interrupt Clear
#define RCC_CIR_HSIRDYC             0x00040000 //!< HSI Ready Interrupt Clear
#define RCC_CIR_HSERDYC             0x00080000 //!< HSE Ready Interrupt Clear
#define RCC_CIR_PLLRDYC             0x00100000 //!< PLL Ready Interrupt Clear
#define RCC_CIR_CSSC                0x00800000 //!< Clock Security System Interrupt Clear

#ifdef STM32F10X_CL
 #define RCC_CIR_PLL2RDYF           0x00000020 //!< PLL2 Ready Interrupt flag
 #define RCC_CIR_PLL3RDYF           0x00000040 //!< PLL3 Ready Interrupt flag
 #define RCC_CIR_PLL2RDYIE          0x00002000 //!< PLL2 Ready Interrupt Enable
 #define RCC_CIR_PLL3RDYIE          0x00004000 //!< PLL3 Ready Interrupt Enable
 #define RCC_CIR_PLL2RDYC           0x00200000 //!< PLL2 Ready Interrupt Clear
 #define RCC_CIR_PLL3RDYC           0x00400000 //!< PLL3 Ready Interrupt Clear
#endif /* STM32F10X_CL */
/** @} */

/** @defgroup RCC_APB2RSTR:	(rcc Offset: 0x0C) APB2 peripheral reset register */
#define RCC_APB2RSTR_AFIORST        0x00000001 //!< Alternate Function I/O reset
#define RCC_APB2RSTR_IOPARST        0x00000004 //!< I/O port A reset
#define RCC_APB2RSTR_IOPBRST        0x00000008 //!< I/O port B reset
#define RCC_APB2RSTR_IOPCRST        0x00000010 //!< I/O port C reset
#define RCC_APB2RSTR_IOPDRST        0x00000020 //!< I/O port D reset
#define RCC_APB2RSTR_ADC1RST        0x00000200 //!< ADC 1 interface reset

#if !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD_VL) && !defined (STM32F10X_HD_VL)
#define RCC_APB2RSTR_ADC2RST        0x00000400 //!< ADC 2 interface reset
#endif

#define RCC_APB2RSTR_TIM1RST        0x00000800 //!< TIM1 Timer reset
#define RCC_APB2RSTR_SPI1RST        0x00001000 //!< SPI 1 reset
#define RCC_APB2RSTR_USART1RST      0x00004000 //!< USART1 reset

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
#define RCC_APB2RSTR_TIM15RST       0x00010000 //!< TIM15 Timer reset
#define RCC_APB2RSTR_TIM16RST       0x00020000 //!< TIM16 Timer reset
#define RCC_APB2RSTR_TIM17RST       0x00040000 //!< TIM17 Timer reset
#endif

#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
 #define RCC_APB2RSTR_IOPERST       0x00000040 //!< I/O port E reset
#endif /* STM32F10X_LD && STM32F10X_LD_VL */

#if defined (STM32F10X_HD) || defined (STM32F10X_XL)
 #define RCC_APB2RSTR_IOPFRST       0x00000080 //!< I/O port F reset
 #define RCC_APB2RSTR_IOPGRST       0x00000100 //!< I/O port G reset
 #define RCC_APB2RSTR_TIM8RST       0x00002000 //!< TIM8 Timer reset
 #define RCC_APB2RSTR_ADC3RST       0x00008000 //!< ADC3 interface reset
#endif

#if defined (STM32F10X_HD_VL)
 #define RCC_APB2RSTR_IOPFRST       0x00000080 //!< I/O port F reset
 #define RCC_APB2RSTR_IOPGRST       0x00000100 //!< I/O port G reset
#endif

