miro-kostadinov/tmos/tmos/hardware/stm32/stm32f1/rcc_f1.h
#ifdef STM32F10X_XL
 #define RCC_APB2RSTR_TIM9RST       0x00080000 //!< TIM9 Timer reset
 #define RCC_APB2RSTR_TIM10RST      0x00100000 //!< TIM10 Timer reset
 #define RCC_APB2RSTR_TIM11RST      0x00200000 //!< TIM11 Timer reset
#endif /* STM32F10X_XL */
/** @} */

/** @defgroup RCC_APB1RSTR:	(rcc Offset: 0x10) APB1 peripheral reset register */
#define RCC_APB1RSTR_TIM2RST        0x00000001 //!< Timer 2 reset
#define RCC_APB1RSTR_TIM3RST        0x00000002 //!< Timer 3 reset
#define RCC_APB1RSTR_WWDGRST        0x00000800 //!< Window Watchdog reset
#define RCC_APB1RSTR_USART2RST      0x00020000 //!< USART 2 reset
#define RCC_APB1RSTR_I2C1RST        0x00200000 //!< I2C 1 reset

#if !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD_VL) && !defined (STM32F10X_HD_VL)
#define RCC_APB1RSTR_CAN1RST        0x02000000 //!< CAN1 reset
#endif

#define RCC_APB1RSTR_BKPRST         0x08000000 //!< Backup interface reset
#define RCC_APB1RSTR_PWRRST         0x10000000 //!< Power interface reset

#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
 #define RCC_APB1RSTR_TIM4RST       0x00000004 //!< Timer 4 reset
 #define RCC_APB1RSTR_SPI2RST       0x00004000 //!< SPI 2 reset
 #define RCC_APB1RSTR_USART3RST     0x00040000 //!< USART 3 reset
 #define RCC_APB1RSTR_I2C2RST       0x00400000 //!< I2C 2 reset
#endif /* STM32F10X_LD && STM32F10X_LD_VL */

#if defined (STM32F10X_HD) || defined (STM32F10X_MD) || defined (STM32F10X_LD) || defined  (STM32F10X_XL)
 #define RCC_APB1RSTR_USBRST        0x00800000 //!< USB Device reset
#endif

#if defined (STM32F10X_HD) || defined  (STM32F10X_CL) || defined  (STM32F10X_XL)
 #define RCC_APB1RSTR_TIM5RST       0x00000008 //!< Timer 5 reset
 #define RCC_APB1RSTR_TIM6RST       0x00000010 //!< Timer 6 reset
 #define RCC_APB1RSTR_TIM7RST       0x00000020 //!< Timer 7 reset
 #define RCC_APB1RSTR_SPI3RST       0x00008000 //!< SPI 3 reset
 #define RCC_APB1RSTR_UART4RST      0x00080000 //!< UART 4 reset
 #define RCC_APB1RSTR_UART5RST      0x00100000 //!< UART 5 reset
 #define RCC_APB1RSTR_DACRST        0x20000000 //!< DAC interface reset
#endif

#if defined (STM32F10X_LD_VL) || defined  (STM32F10X_MD_VL) || defined  (STM32F10X_HD_VL)
 #define RCC_APB1RSTR_TIM6RST       0x00000010 //!< Timer 6 reset
 #define RCC_APB1RSTR_TIM7RST       0x00000020 //!< Timer 7 reset
 #define RCC_APB1RSTR_DACRST        0x20000000 //!< DAC interface reset
 #define RCC_APB1RSTR_CECRST        0x40000000 //!< CEC interface reset
#endif

#if defined  (STM32F10X_HD_VL)
 #define RCC_APB1RSTR_TIM5RST       0x00000008 //!< Timer 5 reset
 #define RCC_APB1RSTR_TIM12RST      0x00000040 //!< TIM12 Timer reset
 #define RCC_APB1RSTR_TIM13RST      0x00000080 //!< TIM13 Timer reset
 #define RCC_APB1RSTR_TIM14RST      0x00000100 //!< TIM14 Timer reset
 #define RCC_APB1RSTR_SPI3RST       0x00008000 //!< SPI 3 reset
 #define RCC_APB1RSTR_UART4RST      0x00080000 //!< UART 4 reset
 #define RCC_APB1RSTR_UART5RST      0x00100000 //!< UART 5 reset
#endif

#ifdef STM32F10X_CL
 #define RCC_APB1RSTR_CAN2RST       0x04000000 //!< CAN2 reset
#endif /* STM32F10X_CL */

#ifdef STM32F10X_XL
 #define RCC_APB1RSTR_TIM12RST      0x00000040 //!< TIM12 Timer reset
 #define RCC_APB1RSTR_TIM13RST      0x00000080 //!< TIM13 Timer reset
 #define RCC_APB1RSTR_TIM14RST      0x00000100 //!< TIM14 Timer reset
#endif /* STM32F10X_XL */
/** @} */

/** @defgroup RCC_AHBENR:	(rcc Offset: 0x14) AHB Peripheral Clock enable register */
#define RCC_AHBENR_DMA1EN           0x00000001 //!< DMA1 clock enable
#define RCC_AHBENR_SRAMEN           0x00000004 //!< SRAM interface clock enable
#define RCC_AHBENR_FLITFEN          0x00000010 //!< FLITF clock enable
#define RCC_AHBENR_CRCEN            0x00000040 //!< CRC clock enable

#if defined (STM32F10X_HD) || defined  (STM32F10X_CL) || defined  (STM32F10X_HD_VL)
 #define RCC_AHBENR_DMA2EN          0x00000002 //!< DMA2 clock enable
#endif

#if defined (STM32F10X_HD) || defined (STM32F10X_XL)
 #define RCC_AHBENR_FSMCEN          0x01000000 //!< FSMC clock enable
 #define RCC_AHBENR_SDIOEN          0x04000000 //!< SDIO clock enable
#endif

#if defined (STM32F10X_HD_VL)
 #define RCC_AHBENR_FSMCEN          0x01000000 //!< FSMC clock enable
#endif

#ifdef STM32F10X_CL
 #define RCC_AHBENR_OTGFSEN         0x00001000 //!< USB OTG FS clock enable
 #define RCC_AHBENR_ETHMACEN        0x00004000 //!< ETHERNET MAC clock enable
 #define RCC_AHBENR_ETHMACTXEN      0x00008000 //!< ETHERNET MAC Tx clock enable
 #define RCC_AHBENR_ETHMACRXEN      0x00010000 //!< ETHERNET MAC Rx clock enable
#endif /* STM32F10X_CL */
/** @} */

/** @defgroup RCC_APB2ENR:	(rcc Offset: 0x18) APB2 peripheral clock enable register */
#define RCC_APB2ENR_AFIOEN          0x00000001 //!< Alternate Function I/O clock enable
#define RCC_APB2ENR_IOPAEN          0x00000004 //!< I/O port A clock enable
#define RCC_APB2ENR_IOPBEN          0x00000008 //!< I/O port B clock enable
#define RCC_APB2ENR_IOPCEN          0x00000010 //!< I/O port C clock enable
#define RCC_APB2ENR_IOPDEN          0x00000020 //!< I/O port D clock enable
#define RCC_APB2ENR_ADC1EN          0x00000200 //!< ADC 1 interface clock enable

#if !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD_VL) && !defined (STM32F10X_HD_VL)
#define RCC_APB2ENR_ADC2EN          0x00000400 //!< ADC 2 interface clock enable
#endif

#define RCC_APB2ENR_TIM1EN          0x00000800 //!< TIM1 Timer clock enable /
#define RCC_APB2ENR_SPI1EN          0x00001000 //!< SPI 1 clock enable
#define RCC_APB2ENR_USART1EN        0x00004000 //!< USART1 clock enable

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
#define RCC_APB2ENR_TIM15EN         0x00010000 //!< TIM15 Timer clock enable
#define RCC_APB2ENR_TIM16EN         0x00020000 //!< TIM16 Timer clock enable
#define RCC_APB2ENR_TIM17EN         0x00040000 //!< TIM17 Timer clock enable
#endif

#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
 #define RCC_APB2ENR_IOPEEN         0x00000040 //!< I/O port E clock enable
#endif /* STM32F10X_LD && STM32F10X_LD_VL */

#if defined (STM32F10X_HD) || defined (STM32F10X_XL)
 #define RCC_APB2ENR_IOPFEN         0x00000080 //!< I/O port F clock enable
 #define RCC_APB2ENR_IOPGEN         0x00000100 //!< I/O port G clock enable
 #define RCC_APB2ENR_TIM8EN         0x00002000 //!< TIM8 Timer clock enable
 #define RCC_APB2ENR_ADC3EN         0x00008000 //!< DMA1 clock enable
#endif

#if defined (STM32F10X_HD_VL)
 #define RCC_APB2ENR_IOPFEN         0x00000080 //!< I/O port F clock enable
 #define RCC_APB2ENR_IOPGEN         0x00000100 //!< I/O port G clock enable
#endif

