miro-kostadinov/tmos/tmos/hardware/stm32/stm32f1/rcc_f1.h
#ifdef STM32F10X_XL
 #define RCC_APB2ENR_TIM9EN         0x00080000 //!< TIM9 Timer clock enable
 #define RCC_APB2ENR_TIM10EN        0x00100000 //!< TIM10 Timer clock enable
 #define RCC_APB2ENR_TIM11EN        0x00200000 //!< TIM11 Timer clock enable
#endif
/** @} */

/** @defgroup RCC_APB1ENR:	(rcc Offset: 0x1C) APB1 peripheral clock enable register */
#define RCC_APB1ENR_TIM2EN          0x00000001 //!< Timer 2 clock enabled
#define RCC_APB1ENR_TIM3EN          0x00000002 //!< Timer 3 clock enable
#define RCC_APB1ENR_WWDGEN          0x00000800 //!< Window Watchdog clock enable
#define RCC_APB1ENR_USART2EN        0x00020000 //!< USART 2 clock enable
#define RCC_APB1ENR_I2C1EN          0x00200000 //!< I2C 1 clock enable

#if !defined (STM32F10X_LD_VL) && !defined (STM32F10X_MD_VL) && !defined (STM32F10X_HD_VL)
#define RCC_APB1ENR_CAN1EN          0x02000000 //!< CAN1 clock enable
#endif

#define RCC_APB1ENR_BKPEN           0x08000000 //!< Backup interface clock enable
#define RCC_APB1ENR_PWREN           0x10000000 //!< Power interface clock enable

#if !defined (STM32F10X_LD) && !defined (STM32F10X_LD_VL)
 #define RCC_APB1ENR_TIM4EN         0x00000004 //!< Timer 4 clock enable
 #define RCC_APB1ENR_SPI2EN         0x00004000 //!< SPI 2 clock enable
 #define RCC_APB1ENR_USART3EN       0x00040000 //!< USART 3 clock enable
 #define RCC_APB1ENR_I2C2EN         0x00400000 //!< I2C 2 clock enable
#endif /* STM32F10X_LD && STM32F10X_LD_VL */

#if defined (STM32F10X_HD) || defined (STM32F10X_MD) || defined  (STM32F10X_LD)
 #define RCC_APB1ENR_USBEN          0x00800000 //!< USB Device clock enable
#endif

#if defined (STM32F10X_HD) || defined  (STM32F10X_CL)
 #define RCC_APB1ENR_TIM5EN         0x00000008 //!< Timer 5 clock enable
 #define RCC_APB1ENR_TIM6EN         0x00000010 //!< Timer 6 clock enable
 #define RCC_APB1ENR_TIM7EN         0x00000020 //!< Timer 7 clock enable
 #define RCC_APB1ENR_SPI3EN         0x00008000 //!< SPI 3 clock enable
 #define RCC_APB1ENR_UART4EN        0x00080000 //!< UART 4 clock enable
 #define RCC_APB1ENR_UART5EN        0x00100000 //!< UART 5 clock enable
 #define RCC_APB1ENR_DACEN          0x20000000 //!< DAC interface clock enable
#endif

#if defined (STM32F10X_LD_VL) || defined  (STM32F10X_MD_VL) || defined  (STM32F10X_HD_VL)
 #define RCC_APB1ENR_TIM6EN         0x00000010 //!< Timer 6 clock enable
 #define RCC_APB1ENR_TIM7EN         0x00000020 //!< Timer 7 clock enable
 #define RCC_APB1ENR_DACEN          0x20000000 //!< DAC interface clock enable
 #define RCC_APB1ENR_CECEN          0x40000000 //!< CEC interface clock enable
#endif

#ifdef STM32F10X_HD_VL
 #define RCC_APB1ENR_TIM5EN         0x00000008 //!< Timer 5 clock enable
 #define RCC_APB1ENR_TIM12EN        0x00000040 //!< TIM12 Timer clock enable
 #define RCC_APB1ENR_TIM13EN        0x00000080 //!< TIM13 Timer clock enable
 #define RCC_APB1ENR_TIM14EN        0x00000100 //!< TIM14 Timer clock enable
 #define RCC_APB1ENR_SPI3EN         0x00008000 //!< SPI 3 clock enable
 #define RCC_APB1ENR_UART4EN        0x00080000 //!< UART 4 clock enable
 #define RCC_APB1ENR_UART5EN        0x00100000 //!< UART 5 clock enable
#endif /* STM32F10X_HD_VL */

#ifdef STM32F10X_CL
 #define RCC_APB1ENR_CAN2EN         0x04000000 //!< CAN2 clock enable
#endif /* STM32F10X_CL */

#ifdef STM32F10X_XL
 #define RCC_APB1ENR_TIM12EN        0x00000040 //!< TIM12 Timer clock enable
 #define RCC_APB1ENR_TIM13EN        0x00000080 //!< TIM13 Timer clock enable
 #define RCC_APB1ENR_TIM14EN        0x00000100 //!< TIM14 Timer clock enable
#endif /* STM32F10X_XL */

/** @} */

/** @defgroup RCC_BDCR:		(rcc Offset: 0x20) Backup domain control register */
#define RCC_BDCR_LSEON              0x00000001 //!< External Low Speed oscillator enable
#define RCC_BDCR_LSERDY             0x00000002 //!< External Low Speed oscillator Ready
#define RCC_BDCR_LSEBYP             0x00000004 //!< External Low Speed oscillator Bypass

/*!< RTC congiguration */
#define RCC_BDCR_RTCSEL             0x00000300 //!< RTCSEL[1:0] bits (RTC clock source selection)
#define RCC_BDCR_RTCSEL_NOCLOCK     0x00000000 //!< No clock
#define RCC_BDCR_RTCSEL_LSE         0x00000100 //!< LSE oscillator clock used as RTC clock
#define RCC_BDCR_RTCSEL_LSI         0x00000200 //!< LSI oscillator clock used as RTC clock
#define RCC_BDCR_RTCSEL_HSE         0x00000300 //!< HSE oscillator clock divided by 128 used as RTC clock

#define RCC_BDCR_RTCEN              0x00008000 //!< RTC clock enable
#define RCC_BDCR_BDRST              0x00010000 //!< Backup domain software reset
/** @} */

/** @defgroup RCC_CSR:		(rcc Offset: 0x24) Control/status register		  */
#define RCC_CSR_LSION               0x00000001 //!< Internal Low Speed oscillator enable
#define RCC_CSR_LSIRDY              0x00000002 //!< Internal Low Speed oscillator Ready
#define RCC_CSR_RMVF                0x01000000 //!< Remove reset flag
#define RCC_CSR_PINRSTF             0x04000000 //!< PIN reset flag
#define RCC_CSR_PORRSTF             0x08000000 //!< POR/PDR reset flag
#define RCC_CSR_SFTRSTF             0x10000000 //!< Software Reset flag
#define RCC_CSR_IWDGRSTF            0x20000000 //!< Independent Watchdog reset flag
#define RCC_CSR_WWDGRSTF            0x40000000 //!< Window watchdog reset flag
#define RCC_CSR_LPWRRSTF            0x80000000 //!< Low-Power reset flag
/** @} */

#ifdef STM32F10X_CL
/** @defgroup RCC_AHBRSTR:	(rcc Offset: 0x28) AHB peripheral clock reset register */
 #define RCC_AHBRSTR_OTGFSRST       0x00001000 //!< USB OTG FS reset
 #define RCC_AHBRSTR_ETHMACRST      0x00004000 //!< ETHERNET MAC reset
/** @} */

/** @defgroup RCC_CFGR2:	(rcc Offset: 0x2C) Clock configuration register2  */
/*!< PREDIV1 configuration */
 #define RCC_CFGR2_PREDIV1          0x0000000F //!< PREDIV1[3:0] bits
 #define RCC_CFGR2_PREDIV1_DIV1     0x00000000 //!< PREDIV1 input clock not divided
 #define RCC_CFGR2_PREDIV1_DIV2     0x00000001 //!< PREDIV1 input clock divided by 2
 #define RCC_CFGR2_PREDIV1_DIV3     0x00000002 //!< PREDIV1 input clock divided by 3
 #define RCC_CFGR2_PREDIV1_DIV4     0x00000003 //!< PREDIV1 input clock divided by 4
 #define RCC_CFGR2_PREDIV1_DIV5     0x00000004 //!< PREDIV1 input clock divided by 5
 #define RCC_CFGR2_PREDIV1_DIV6     0x00000005 //!< PREDIV1 input clock divided by 6
 #define RCC_CFGR2_PREDIV1_DIV7     0x00000006 //!< PREDIV1 input clock divided by 7
 #define RCC_CFGR2_PREDIV1_DIV8     0x00000007 //!< PREDIV1 input clock divided by 8
 #define RCC_CFGR2_PREDIV1_DIV9     0x00000008 //!< PREDIV1 input clock divided by 9
 #define RCC_CFGR2_PREDIV1_DIV10    0x00000009 //!< PREDIV1 input clock divided by 10
 #define RCC_CFGR2_PREDIV1_DIV11    0x0000000A //!< PREDIV1 input clock divided by 11
 #define RCC_CFGR2_PREDIV1_DIV12    0x0000000B //!< PREDIV1 input clock divided by 12
 #define RCC_CFGR2_PREDIV1_DIV13    0x0000000C //!< PREDIV1 input clock divided by 13
 #define RCC_CFGR2_PREDIV1_DIV14    0x0000000D //!< PREDIV1 input clock divided by 14
 #define RCC_CFGR2_PREDIV1_DIV15    0x0000000E //!< PREDIV1 input clock divided by 15
 #define RCC_CFGR2_PREDIV1_DIV16    0x0000000F //!< PREDIV1 input clock divided by 16

