miro-kostadinov/tmos/tmos/hardware/stm32/stm32f1/rcc_f1.h
/*!< PREDIV2 configuration */
 #define RCC_CFGR2_PREDIV2          0x000000F0 //!< PREDIV2[3:0] bits
 #define RCC_CFGR2_PREDIV2_DIV1     0x00000000 //!< PREDIV2 input clock not divided
 #define RCC_CFGR2_PREDIV2_DIV2     0x00000010 //!< PREDIV2 input clock divided by 2
 #define RCC_CFGR2_PREDIV2_DIV3     0x00000020 //!< PREDIV2 input clock divided by 3
 #define RCC_CFGR2_PREDIV2_DIV4     0x00000030 //!< PREDIV2 input clock divided by 4
 #define RCC_CFGR2_PREDIV2_DIV5     0x00000040 //!< PREDIV2 input clock divided by 5
 #define RCC_CFGR2_PREDIV2_DIV6     0x00000050 //!< PREDIV2 input clock divided by 6
 #define RCC_CFGR2_PREDIV2_DIV7     0x00000060 //!< PREDIV2 input clock divided by 7
 #define RCC_CFGR2_PREDIV2_DIV8     0x00000070 //!< PREDIV2 input clock divided by 8
 #define RCC_CFGR2_PREDIV2_DIV9     0x00000080 //!< PREDIV2 input clock divided by 9
 #define RCC_CFGR2_PREDIV2_DIV10    0x00000090 //!< PREDIV2 input clock divided by 10
 #define RCC_CFGR2_PREDIV2_DIV11    0x000000A0 //!< PREDIV2 input clock divided by 11
 #define RCC_CFGR2_PREDIV2_DIV12    0x000000B0 //!< PREDIV2 input clock divided by 12
 #define RCC_CFGR2_PREDIV2_DIV13    0x000000C0 //!< PREDIV2 input clock divided by 13
 #define RCC_CFGR2_PREDIV2_DIV14    0x000000D0 //!< PREDIV2 input clock divided by 14
 #define RCC_CFGR2_PREDIV2_DIV15    0x000000E0 //!< PREDIV2 input clock divided by 15
 #define RCC_CFGR2_PREDIV2_DIV16    0x000000F0 //!< PREDIV2 input clock divided by 16

/*!< PLL2MUL configuration */
 #define RCC_CFGR2_PLL2MUL          0x00000F00 //!< PLL2MUL[3:0] bits
 #define RCC_CFGR2_PLL2MUL8         0x00000600 //!< PLL2 input clock * 8
 #define RCC_CFGR2_PLL2MUL9         0x00000700 //!< PLL2 input clock * 9
 #define RCC_CFGR2_PLL2MUL10        0x00000800 //!< PLL2 input clock * 10
 #define RCC_CFGR2_PLL2MUL11        0x00000900 //!< PLL2 input clock * 11
 #define RCC_CFGR2_PLL2MUL12        0x00000A00 //!< PLL2 input clock * 12
 #define RCC_CFGR2_PLL2MUL13        0x00000B00 //!< PLL2 input clock * 13
 #define RCC_CFGR2_PLL2MUL14        0x00000C00 //!< PLL2 input clock * 14
 #define RCC_CFGR2_PLL2MUL16        0x00000E00 //!< PLL2 input clock * 16
 #define RCC_CFGR2_PLL2MUL20        0x00000F00 //!< PLL2 input clock * 20

/*!< PLL3MUL configuration */
 #define RCC_CFGR2_PLL3MUL          0x0000F000 //!< PLL3MUL[3:0] bits
 #define RCC_CFGR2_PLL3MUL8         0x00006000 //!< PLL3 input clock * 8
 #define RCC_CFGR2_PLL3MUL9         0x00007000 //!< PLL3 input clock * 9
 #define RCC_CFGR2_PLL3MUL10        0x00008000 //!< PLL3 input clock * 10
 #define RCC_CFGR2_PLL3MUL11        0x00009000 //!< PLL3 input clock * 11
 #define RCC_CFGR2_PLL3MUL12        0x0000A000 //!< PLL3 input clock * 12
 #define RCC_CFGR2_PLL3MUL13        0x0000B000 //!< PLL3 input clock * 13
 #define RCC_CFGR2_PLL3MUL14        0x0000C000 //!< PLL3 input clock * 14
 #define RCC_CFGR2_PLL3MUL16        0x0000E000 //!< PLL3 input clock * 16
 #define RCC_CFGR2_PLL3MUL20        0x0000F000 //!< PLL3 input clock * 20

 #define RCC_CFGR2_PREDIV1SRC       0x00010000 //!< PREDIV1 entry clock source
 #define RCC_CFGR2_PREDIV1SRC_PLL2  0x00010000 //!< PLL2 selected as PREDIV1 entry clock source
 #define RCC_CFGR2_PREDIV1SRC_HSE   0x00000000 //!< HSE selected as PREDIV1 entry clock source
 #define RCC_CFGR2_I2S2SRC          0x00020000 //!< I2S2 entry clock source
 #define RCC_CFGR2_I2S3SRC          0x00040000 //!< I2S3 clock source
/** @} */
#endif /* STM32F10X_CL */

#if defined (STM32F10X_LD_VL) || defined (STM32F10X_MD_VL) || defined (STM32F10X_HD_VL)
/** @defgroup RCC_CFGR2:	(rcc Offset: 0x2C) Clock configuration register2  */
/*!< PREDIV1 configuration */
 #define RCC_CFGR2_PREDIV1          0x0000000F //!< PREDIV1[3:0] bits */
 #define RCC_CFGR2_PREDIV1_DIV1     0x00000000 //!< PREDIV1 input clock not divided
 #define RCC_CFGR2_PREDIV1_DIV2     0x00000001 //!< PREDIV1 input clock divided by 2
 #define RCC_CFGR2_PREDIV1_DIV3     0x00000002 //!< PREDIV1 input clock divided by 3
 #define RCC_CFGR2_PREDIV1_DIV4     0x00000003 //!< PREDIV1 input clock divided by 4
 #define RCC_CFGR2_PREDIV1_DIV5     0x00000004 //!< PREDIV1 input clock divided by 5
 #define RCC_CFGR2_PREDIV1_DIV6     0x00000005 //!< PREDIV1 input clock divided by 6
 #define RCC_CFGR2_PREDIV1_DIV7     0x00000006 //!< PREDIV1 input clock divided by 7
 #define RCC_CFGR2_PREDIV1_DIV8     0x00000007 //!< PREDIV1 input clock divided by 8
 #define RCC_CFGR2_PREDIV1_DIV9     0x00000008 //!< PREDIV1 input clock divided by 9
 #define RCC_CFGR2_PREDIV1_DIV10    0x00000009 //!< PREDIV1 input clock divided by 10
 #define RCC_CFGR2_PREDIV1_DIV11    0x0000000A //!< PREDIV1 input clock divided by 11
 #define RCC_CFGR2_PREDIV1_DIV12    0x0000000B //!< PREDIV1 input clock divided by 12
 #define RCC_CFGR2_PREDIV1_DIV13    0x0000000C //!< PREDIV1 input clock divided by 13
 #define RCC_CFGR2_PREDIV1_DIV14    0x0000000D //!< PREDIV1 input clock divided by 14
 #define RCC_CFGR2_PREDIV1_DIV15    0x0000000E //!< PREDIV1 input clock divided by 15
 #define RCC_CFGR2_PREDIV1_DIV16    0x0000000F //!< PREDIV1 input clock divided by 16
#endif
/** @} */





/** @} */ // @defgroup RCC_regs_define

/**
 * @brief In the following line adjust the value of External High Speed oscillator (HSE)
   used in your application

   Tip: To avoid modifying this file each time you need to use different HSE, you
        can define the HSE value in your toolchain compiler preprocessor.
  */
#ifndef  HSE_VALUE
 #ifdef STM32F10X_CL
  #define HSE_VALUE    25000000 /*!< Value of the External oscillator in Hz */
 #else
  #define HSE_VALUE    8000000  /*!< Value of the External oscillator in Hz */
 #endif /* STM32F10X_CL */
#endif /* HSE_VALUE */
/**
 * @brief In the following line adjust the External High Speed oscillator (HSE) Startup
   Timeout value
   */
#ifndef HSE_STARTUP_TIMEOUT
#define HSE_STARTUP_TIMEOUT   0x0500 /*!< Time out for HSE start up */
#endif

#ifndef HSI_VALUE
#define HSI_VALUE    8000000 /*!< Value of the Internal oscillator in Hz*/
#endif

typedef struct
{
	uint32_t SYSCLK_Frequency; 	//!< SYSCLK clock frequency expressed in Hz
	uint32_t HCLK_Frequency; 	//!< HCLK clock frequency expressed in Hz
	uint32_t PCLK1_Frequency; 	//!< PCLK1 clock frequency expressed in Hz
	uint32_t PCLK2_Frequency; 	//!< PCLK2 clock frequency expressed in Hz
	uint32_t ADCCLK_Frequency; 	//!< ADCCLK clock frequency expressed in Hz
} RCC_ClocksTypeDef;


void RCCPeripheralReset(unsigned int periph_id);
void RCCPeripheralEnable(unsigned int periph_id);
void RCCPeripheralDisable(unsigned int periph_id);

void RCC_GetClocksFreq(RCC_ClocksTypeDef* RCC_Clocks);

#endif /* RCC_F1_H_ */
